Tekla Open API Reference for Tekla Structures 2025
BoltGroup.PlainHoleType Property
 Gets or sets the plain hole type.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public BoltGroup.BoltPlainHoleTypeEnum PlainHoleType { get; set; }
Public Property PlainHoleType As BoltGroup.BoltPlainHoleTypeEnum
	Get
	Set
Property Value
Type: BoltGroup.BoltPlainHoleTypeEnum
See Also
Reference
BoltGroup Class
Tekla.Structures.Model Namespace